#+TITLE:  Initiation to Perl
#+AUTHOR: Jerome SANCHEZ
#+DATE: [2020-06-19 Fri]
#+TODO: TODO WORKINGON | DONE CANCEL
#+TODO: UPDATE MOVE EXPLAIN EXAMPLE |

**** String
     In Perl, a string is a sequence of characters surrounded by some kinds of quotation marks.
     A string can contain ASCII, UNICODE and escape sequences characters such as \n.

    #+begin_src perl :results output
    my $s = "Perl";

    my $str_static = 'a string $s without interpolation and escaping a single quote \' \n*';
    my $str_q      = q/a string $s without interpolation and a single quote ' \n*/;

    my $str_i        = "a string $s with interpolation and a single quote ' \n";
    my $str_qq       = qq/a string $s with interpolation and a single quote ' \n/;
    my $str_qq_delim = qq{a string $s with interpolation and a single quote ' \n};

    printf " %s\n %s", $str_q, $str_static;
    print  "\n";
    printf " %s %s %s",  $str_i, $str_qq, $str_qq_delim;
#+end_src

#+RESULTS:
:  a string $s without interpolation and a single quote ' \n*
:  a string $s without interpolation and escaping a single quote ' \n*
:  a string Perl with interpolation and a single quote ' 
:  a string Perl with interpolation and a single quote ' 
:  a string Perl with interpolation and a single quote ' 

**** Exercices
    1. Add two value
      #+begin_src perl :results output
      my $un=1;
      my $deux=2;
      print $un + $deux;
      print "\n";
      #+end_src

      #+RESULTS:
      : 3

    2. Concat two strings
      #+begin_src perl :results output
      my $str1="Hello";
      my $str2="World!";
      print $str1." ".$str2."\n";
      #+end_src

      #+RESULTS:
      : Hello World
   
    3. Where is char 'e'
      #+begin_src perl :results output
      print index ("j'ai trouve le caractere",'e');
      #+end_src

**** Affectation
    #+begin_src perl :shebang "#!/usr/local/bin/perl" :results output
    use warnings;
    use strict;

    my @empty = ();                       # Empty array from list
    my @t1 = (3,'chaine',"hello here"); # Copy a list to an array
    my ($a,$b,$c)=(3, 'string', "hello here"); # affectation of several values

    print " Array : @t1 (before)\n";
    $t1[1] = 4;                          # change second element
    print " Array : @t1 (after)\n";

    print "Copy array\n";
    my @t2 = (1,2);
    print " Array : @t1 (before)\n";
    @t1 = @t2;
    print " Array : @t1 (after)\n";
    my ($premier, $second)= @t1; # multiple assignement

    my $count_t2 = scalar @t2; # get the number of element into an array
    print 'Size of @t2 = '.$count_t2."\n";

    # Remove and append element at the head
    my @simple_array = (1,2,3);
    print "Simple array = @simple_array \t shift \@simple_array = ".(shift @simple_array)." \t Simple array = @simple_array \n";
    @simple_array = (1,2,3);
    print "Simple array = @simple_array \t unshift \@simple_array,(-1,0) = ".(unshift @simple_array, (-1,0))." \t Simple array = @simple_array \n";

    # Remove and append element at the tail
    my @simple_array = (1,2,3);
    print "Simple array = @simple_array \t pop \@simple_array = ".(pop @simple_array)." \t Simple array = @simple_array \n";
    @simple_array = (1,2,3);
    print "Simple array = @simple_array \t push \@simple_array,(4,5) = ".(push @simple_array, (4,5))." \t Simple array = @simple_array \n";

    #+end_src

    #+RESULTS:
    #+begin_example
     Array : 3 chaine hello here (before)
     Array : 3 4 hello here (after)
    Copy array
     Array : 3 4 hello here (before)
     Array : 1 2 (after)
    Size of @t2 = 2
    Simple array = 1 2 3 	 shift @simple_array = 1 	 Simple array = 2 3 
    Simple array = 1 2 3 	 unshift @simple_array,(-1,0) = 5 	 Simple array = -1 0 1 2 3 
    Simple array = 1 2 3 	 pop @simple_array = 3 	 Simple array = 1 2 
    Simple array = 1 2 3 	 push @simple_array,(4,5) = 5 	 Simple array = 1 2 3 4 5 
    #+end_example

** If-then-else statements

   #+begin_src perl :results output
   my $age=35;
   if ($age < 18 ) {
     # Block
     print "Fruit juice\n";
   }
   elsif ( $age > 85) {
     # Block
     print "A tea\n";
   }
   else {
     # Block
     print "a beer\n";
   }

   print "if true\n" if (1);
   print "unless false\n" unless (0);

   #+end_src

   #+RESULTS:
   : a beer
   : if true
   : unless false

*** Break a loop
   - next : next element
   - last : quit 
   - redo : reprocess 
   - goto : jump to a label (beware it's could injure your health mentality)

#+begin_src perl :results output
   # Example 
   my $i = 0;
   my %h=(1 => 'a');
   LABEL: 
       while( $i <= 20 ) {
        print "$i\n";
        LABEL_HASH: foreach my $k (keys %h) {
            if ($i > 15) {
              print "Here with i = $i\n";
              $i+=2;
              goto LABEL;
            }
            print " keys = $k\t Value=$h{$k}\n";
        }
        $i+=2;
       }
#+end_src

#+RESULTS:
#+begin_example
0
 keys = 1	 Value=a
2
 keys = 1	 Value=a
4
 keys = 1	 Value=a
6
 keys = 1	 Value=a
8
 keys = 1	 Value=a
10
 keys = 1	 Value=a
12
 keys = 1	 Value=a
14
 keys = 1	 Value=a
16
Here with i = 16
18
Here with i = 18
20
Here with i = 20
#+end_example


#+begin_src perl :results output
my $already_work=0; # prevent infinite loop when $i equals 4, because we redo it without incrementation
for( my $i=0; $i<=20; $i++ ) {
 if ($i == 4 && !$already_work) {
     $already_work=1;
     print "$i\n";
     redo;
 }
 next if ($i %2); # only even
 last if ($i>15); # quit if $i>15
 print "$i\n";
}

print "already_work=$already_work\n";
#+end_src

#+RESULTS:
#+begin_example
0
2
4
4
6
8
10
12
14
already_work=1
#+end_example


** Syntax
   To define a subroutine, you use the following syntax:
#+begin_src perl
   sub NAME PROTOTYPES ATTRIBUTES BLOCK
#+end_src

   For IAI context, we use a lighter form to declare a subroutine
#+begin_src perl
   sub NAME  BLOCK
#+end_src

#+begin_src perl :results output
use warnings;
use strict;

sub say_something {
  print "Hi, this is a subroutine\n";
}

# Different ways to call a subroutine
&say_something;  # Optional '&'
say_something(); # explicitly call a subroutine
say_something;   # No parameters

#+end_src

#+RESULTS:
: Hi, this is a subroutine
: Hi, this is a subroutine
: Hi, this is a subroutine

  - The subroutines parameters are scalar only
  - The parameters are ordered and anonymous
  - You can access to the parameters through array : @_
  - Subroutine can *return* a scalar, a list, an array, a hash, a pointer, ...

#+begin_src perl :results output
use warnings;
use strict;

sub say_something {
  #@_
  my @a=@_;
  foreach my $v (@a) {
    print "Parameter = $v\n";  
  }
  
  print "Parameter first = $a[0]\n";
}

say_something (1,2,3);

#+end_src

#+RESULTS:
: Parameter = 1
: Parameter = 2
: Parameter = 3
: Parameter first = 1

** Use a module
#+begin_src perl :results output

use warnings;
use strict;

use JSON qw(encode_json decode_json); # load JSON.pm and use encode and decode subroutine

my @data=(1,2,3,4);
print "Json string of data = '".encode_json(\@data)."'\n";

my $debug=1;
if ($debug) {
  require Data::Dumper; # load Data/Dumper.pm only if $debug is "true"
  print "Data=".Data::Dumper::Dumper(\@data)."\n";
}

exit(0);

#+end_src

#+RESULTS:
: Json data=[1,2,3,4]
: Data=$VAR1 = [
:           1,
:           2,
:           3,
:           4
:         ];
: 


** Creation

#+begin_src perl :results output
package A;

sub new {
    my $self={};
    $self->{'attribut'}="A";
    print "Ref Self = ".ref($self)."\n";
    $self=bless($self, "A");
    print "Ref Self = ".ref($self)."\n";
    return $self;
}

sub dosomething {
    print "An output from A";
}
1; ## End of package A

package B;

sub new {
    my $self={};
    $self->{'attribut'}="B";
    print "Ref Self = ".ref($self)."\n";
    $self=bless($self, "B");
    print "Ref Self = ".ref($self)."\n";
    return $self;
}

sub dosomething {
    print "An output from B";
}
1; ## End of package B

use strict;
use warnings;
use Data::Dumper;

my $variable=A->new();
$variable->dosomething();
print "\nDump variable=".Dumper($variable)."\n";

#$variable=B->new();
bless($variable,"B");
$variable->dosomething();
print "\nDump variable=".Dumper($variable)."\n";

exit 0;

#+end_src

#+RESULTS:
#+begin_example
Ref Self = HASH
Ref Self = A
An output from A
Dump variable=$VAR1 = bless( {
                 'attribut' => 'A'
               }, 'A' );

An output from B
Dump variable=$VAR1 = bless( {
                 'attribut' => 'A'
               }, 'B' );

#+end_example

**** Example
#+begin_src perl :results output
package Vehicule;

use strict;
use warnings;

# for construct the object we use a method named "new()"
# usage: my $truck = Vehicule->new(6,'GREEN');
sub new {
  my ($class,$nbwheel,$color) = @_;

  my $this = {};
  $this->{NB_WHEEL} = $nbwheel;
  $this->{COLOR} = $color;

  # The built-in function bless is used to bless the reference to the class and return an instance of the class.
  return bless($this, $class);  # promote $this to an object
}

# fonction to change the color
# $v1->rePaint(-color=>'BLUE');
sub rePaint {
  my $this=shift;
  my %params=@_;

  $this->{COLOR} = $params{-color};
  return;
}

1;

##
# MAIN
##
use strict;
use warnings;

use Data::Dumper;

my $truck = Vehicule->new(6,'GREEN');
print  "##create truck=".Dumper($truck)."\n";

$truck->{COLOR}='BLUE';
$truck->{RECEPTION}=['TV','RADIO'];
print  "##change truck=".Dumper($truck)."\n";

$truck->rePaint(-color=>"BLACK");
print  "##repaint truck=".Dumper($truck)."\n";

exit 0;

#+end_src

#+RESULTS:
#+begin_example
##create truck=$VAR1 = bless( {
                 'NB_WHEEL' => 6,
                 'COLOR' => 'GREEN'
               }, 'Vehicule' );

##change truck=$VAR1 = bless( {
                 'RECEPTION' => [
                                  'TV',
                                  'RADIO'
                                ],
                 'NB_WHEEL' => 6,
                 'COLOR' => 'BLUE'
               }, 'Vehicule' );

##repaint truck=$VAR1 = bless( {
                 'RECEPTION' => [
                                  'TV',
                                  'RADIO'
                                ],
                 'NB_WHEEL' => 6,
                 'COLOR' => 'BLACK'
               }, 'Vehicule' );

#+end_example




* Error Handling
  - Bacis tools:
    Warnings : warn
    Fatal error : die

  - Auxiliary Library *Carp* :

#+begin_src perl 
use Carp qw(cluck);

carp "Message";
cluck "Message";
croak "Message";
confess "Message";

#+end_src

    - Functions and impacts
      Fatal => exit program
      Stack => print the stack function call of the program

|         | Fatal | Stacktrace |
|---------+-------+------------|
| carp    | N     | N          |
| cluck   | N     | Y          |
| croak   | Y     | N          |
| confess | Y     | Y          |


  - Reserved word *eval* and message *$@*

    #+begin_src perl :results output
    eval {
      my $a=[1,2,3];
      die "I want to stop!!";
      print "A invisible message\n";
    };

    my $error = $@;
    if( $error ) {
      print "Error message: $error\n";
    }
    #+end_src

    #+RESULTS:
    : Error message: I want to stop!! at - line 3.

     
* Global standard variables
  [[https://perldoc.perl.org/perlvar.html][perlvar]] (english site)

  $_ current value
  @_ array of sub program parameter

#+begin_src perl :results output

foreach ('a'..'d') {
  print; # like: print $_;
  print "\n";
  print "With \$_ = ". $_ ."\n";
}

print "\n============\n";
sub f {
  print "Parameters = ".join(', ',@_)."\n";
  print "Parameter 2 = ".$_[1]."\n";
}

f(1,2,3,4);

#+end_src



  @ARGV command line parameter
#+begin_src shell :results output
perl -e 'foreach (@ARGV) { print $_; print ", ";}' 1 2 3 4
#+end_src

#+RESULTS:
: 1, 2, 3, 4, 

  $0 program name
  $$ current pid
  %ENV environment variables
  @INC path of libs perl

#+begin_src shell :results output
perl -e 'print "progname= $0 \t PID= $$ \t User= $ENV{USER} \nPerl path libs= @INC \n";'
#+end_src

#+RESULTS:
: progname= -e 	 PID= 11927 	 User= jsa 
:  Perl path libs= /usr/local/libdata/perl5/site_perl/i386-openbsd /usr/local/libdata/perl5/site_perl /usr/libdata/perl5/i386-openbsd /usr/libdata/perl5 

** Frequentally used Regex operator
   =~
   !~ 
   m//  m%% m{} m() 
   s///  s%%% s{}{} s()()
   tr/// 
#+begin_src perl :results output
if ("text" =~ m/ex/) {
  print "text contains 'ex'\n";
}
my $test='a short text';
$test =~ s/short/long/;
print "Test = $test\n";
$test =~ tr/t/p/;
print "Test = $test\n";

#+end_src

#+RESULTS:
: text contains 'ex'
: Test = a long text
: Test = a long pexp


*** Regex like a variable
   my $maregex=qr//;
#+begin_src perl :results output
my $regex=qr(ex);

if ("text" =~ m/$regex/) {
  print "text contains $regex\n";
}
#+end_src

#+RESULTS:
: text contains (?^:ex)


** Capture Group 
    capturing value from regex

#+begin_src perl :results output
my @urls=( "www.google.com",
  "http://www.google.com",
  "http://www.google.com/",
  "http://www.google.com/api/search?q=1");

foreach my $url (@urls) {
  print "URL= $url\n";
  if ( $url =~ m%((http|https)://)?([\w|.|-]+)(/(.*)\?(.*))?% ) {
    my $proto=$1;
    print "Protocol= $1 - $2\n";
    print "FQDN= $3\n";
    print "Full Path= $4\n";
    print "Path = $5\n";
    print "Parameter = $6\n";
  }
  print "\n";
}

#+end_src

#+RESULTS:
#+begin_example
URL= www.google.com
Protocol=  - 
FQDN= www.google.com
Full Path= 
Path = 
Parameter = 

URL= http://www.google.com
Protocol= http:// - http
FQDN= www.google.com
Full Path= 
Path = 
Parameter = 

URL= http://www.google.com/
Protocol= http:// - http
FQDN= www.google.com
Full Path= 
Path = 
Parameter = 

URL= http://www.google.com/api/search?q=1
Protocol= http:// - http
FQDN= www.google.com
Full Path= /api/search?q=1
Path = api/search
Parameter = q=1

#+end_example

